MikroElektronika/core_packages/RX/gcc/def/renesas/R5F572MDHGFC/mcu.h
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long LINE : 11;
			unsigned long  : 5;
			unsigned long SEL : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long SEL : 1;
			unsigned long  : 5;
			unsigned long LINE : 11;
#endif
	} BIT;
	} GR2CLUTINT;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long ARCST : 1;
			unsigned long  : 15;
			unsigned long UFST : 1;
			unsigned long  : 15;
#else
			unsigned long  : 15;
			unsigned long UFST : 1;
			unsigned long  : 15;
			unsigned long ARCST : 1;
#endif
	} BIT;
	} GR2MON;
	char           wk8[168];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VEN : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long VEN : 1;
#endif
	} BIT;
	} GAMGVEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAMON : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long GAMON : 1;
#endif
	} BIT;
	} GAMSW;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN01 : 11;
			unsigned long  : 5;
			unsigned long GAIN00 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN00 : 11;
			unsigned long  : 5;
			unsigned long GAIN01 : 11;
#endif
	} BIT;
	} GAMGLUT1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN03 : 11;
			unsigned long  : 5;
			unsigned long GAIN02 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN02 : 11;
			unsigned long  : 5;
			unsigned long GAIN03 : 11;
#endif
	} BIT;
	} GAMGLUT2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN05 : 11;
			unsigned long  : 5;
			unsigned long GAIN04 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN04 : 11;
			unsigned long  : 5;
			unsigned long GAIN05 : 11;
#endif
	} BIT;
	} GAMGLUT3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN07 : 11;
			unsigned long  : 5;
			unsigned long GAIN06 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN06 : 11;
			unsigned long  : 5;
			unsigned long GAIN07 : 11;
#endif
	} BIT;
	} GAMGLUT4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN09 : 11;
			unsigned long  : 5;
			unsigned long GAIN08 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN08 : 11;
			unsigned long  : 5;
			unsigned long GAIN09 : 11;
#endif
	} BIT;
	} GAMGLUT5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN11 : 11;
			unsigned long  : 5;
			unsigned long GAIN10 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN10 : 11;
			unsigned long  : 5;
			unsigned long GAIN11 : 11;
#endif
	} BIT;
	} GAMGLUT6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN13 : 11;
			unsigned long  : 5;
			unsigned long GAIN12 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN12 : 11;
			unsigned long  : 5;
			unsigned long GAIN13 : 11;
#endif
	} BIT;
	} GAMGLUT7;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN15 : 11;
			unsigned long  : 5;
			unsigned long GAIN14 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN14 : 11;
			unsigned long  : 5;
			unsigned long GAIN15 : 11;
#endif
	} BIT;
	} GAMGLUT8;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH03 : 10;
			unsigned long TH02 : 10;
			unsigned long TH01 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH01 : 10;
			unsigned long TH02 : 10;
			unsigned long TH03 : 10;
#endif
	} BIT;
	} GAMGAREA1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH06 : 10;
			unsigned long TH05 : 10;
			unsigned long TH04 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH04 : 10;
			unsigned long TH05 : 10;
			unsigned long TH06 : 10;
#endif
	} BIT;
	} GAMGAREA2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH09 : 10;
			unsigned long TH08 : 10;
			unsigned long TH07 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH07 : 10;
			unsigned long TH08 : 10;
			unsigned long TH09 : 10;
#endif
	} BIT;
	} GAMGAREA3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH12 : 10;
			unsigned long TH11 : 10;
			unsigned long TH10 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH10 : 10;
			unsigned long TH11 : 10;
			unsigned long TH12 : 10;
#endif
	} BIT;
	} GAMGAREA4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH15 : 10;
			unsigned long TH14 : 10;
			unsigned long TH13 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH13 : 10;
			unsigned long TH14 : 10;
			unsigned long TH15 : 10;
#endif
	} BIT;
	} GAMGAREA5;
	char           wk9[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VEN : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long VEN : 1;
#endif
	} BIT;
	} GAMBVEN;
	char           wk10[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN01 : 11;
			unsigned long  : 5;
			unsigned long GAIN00 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN00 : 11;
			unsigned long  : 5;
			unsigned long GAIN01 : 11;
#endif
	} BIT;
	} GAMBLUT1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN03 : 11;
			unsigned long  : 5;
			unsigned long GAIN02 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN02 : 11;
			unsigned long  : 5;
			unsigned long GAIN03 : 11;
#endif
	} BIT;
	} GAMBLUT2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN05 : 11;
			unsigned long  : 5;
			unsigned long GAIN04 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN04 : 11;
			unsigned long  : 5;
			unsigned long GAIN05 : 11;
#endif
	} BIT;
	} GAMBLUT3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN07 : 11;
			unsigned long  : 5;
			unsigned long GAIN06 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN06 : 11;
			unsigned long  : 5;
			unsigned long GAIN07 : 11;
#endif
	} BIT;
	} GAMBLUT4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN09 : 11;
			unsigned long  : 5;
			unsigned long GAIN08 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN08 : 11;
			unsigned long  : 5;
			unsigned long GAIN09 : 11;
#endif
	} BIT;
	} GAMBLUT5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN11 : 11;
			unsigned long  : 5;
			unsigned long GAIN10 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN10 : 11;
			unsigned long  : 5;
			unsigned long GAIN11 : 11;
#endif
	} BIT;
	} GAMBLUT6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN13 : 11;
			unsigned long  : 5;
			unsigned long GAIN12 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN12 : 11;
			unsigned long  : 5;
			unsigned long GAIN13 : 11;
#endif
	} BIT;
	} GAMBLUT7;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN15 : 11;
			unsigned long  : 5;
			unsigned long GAIN14 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN14 : 11;
			unsigned long  : 5;
			unsigned long GAIN15 : 11;
#endif
	} BIT;
	} GAMBLUT8;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH03 : 10;
			unsigned long TH02 : 10;
			unsigned long TH01 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH01 : 10;
			unsigned long TH02 : 10;
			unsigned long TH03 : 10;
#endif
	} BIT;
	} GAMBAREA1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH06 : 10;
			unsigned long TH05 : 10;
			unsigned long TH04 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH04 : 10;
			unsigned long TH05 : 10;
			unsigned long TH06 : 10;
#endif
	} BIT;
	} GAMBAREA2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH09 : 10;
			unsigned long TH08 : 10;
			unsigned long TH07 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH07 : 10;
			unsigned long TH08 : 10;
			unsigned long TH09 : 10;
#endif
	} BIT;
	} GAMBAREA3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH12 : 10;
			unsigned long TH11 : 10;
			unsigned long TH10 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH10 : 10;
			unsigned long TH11 : 10;
			unsigned long TH12 : 10;
#endif
	} BIT;
	} GAMBAREA4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH15 : 10;
			unsigned long TH14 : 10;
			unsigned long TH13 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH13 : 10;
			unsigned long TH14 : 10;
			unsigned long TH15 : 10;
#endif
	} BIT;
	} GAMBAREA5;
	char           wk11[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VEN : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long VEN : 1;
#endif
	} BIT;
	} GAMRVEN;
	char           wk12[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN01 : 11;
			unsigned long  : 5;
			unsigned long GAIN00 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN00 : 11;
			unsigned long  : 5;
			unsigned long GAIN01 : 11;
#endif
	} BIT;
	} GAMRLUT1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN03 : 11;
			unsigned long  : 5;
			unsigned long GAIN02 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN02 : 11;
			unsigned long  : 5;
			unsigned long GAIN03 : 11;
#endif
	} BIT;
	} GAMRLUT2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN05 : 11;
			unsigned long  : 5;
			unsigned long GAIN04 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN04 : 11;
			unsigned long  : 5;
			unsigned long GAIN05 : 11;
#endif
	} BIT;
	} GAMRLUT3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN07 : 11;
			unsigned long  : 5;
			unsigned long GAIN06 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN06 : 11;
			unsigned long  : 5;
			unsigned long GAIN07 : 11;
#endif
	} BIT;
	} GAMRLUT4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN09 : 11;
			unsigned long  : 5;
			unsigned long GAIN08 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN08 : 11;
			unsigned long  : 5;
			unsigned long GAIN09 : 11;
#endif
	} BIT;
	} GAMRLUT5;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN11 : 11;
			unsigned long  : 5;
			unsigned long GAIN10 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN10 : 11;
			unsigned long  : 5;
			unsigned long GAIN11 : 11;
#endif
	} BIT;
	} GAMRLUT6;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN13 : 11;
			unsigned long  : 5;
			unsigned long GAIN12 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN12 : 11;
			unsigned long  : 5;
			unsigned long GAIN13 : 11;
#endif
	} BIT;
	} GAMRLUT7;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long GAIN15 : 11;
			unsigned long  : 5;
			unsigned long GAIN14 : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long GAIN14 : 11;
			unsigned long  : 5;
			unsigned long GAIN15 : 11;
#endif
	} BIT;
	} GAMRLUT8;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH03 : 10;
			unsigned long TH02 : 10;
			unsigned long TH01 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH01 : 10;
			unsigned long TH02 : 10;
			unsigned long TH03 : 10;
#endif
	} BIT;
	} GAMRAREA1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH06 : 10;
			unsigned long TH05 : 10;
			unsigned long TH04 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH04 : 10;
			unsigned long TH05 : 10;
			unsigned long TH06 : 10;
#endif
	} BIT;
	} GAMRAREA2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH09 : 10;
			unsigned long TH08 : 10;
			unsigned long TH07 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH07 : 10;
			unsigned long TH08 : 10;
			unsigned long TH09 : 10;
#endif
	} BIT;
	} GAMRAREA3;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH12 : 10;
			unsigned long TH11 : 10;
			unsigned long TH10 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH10 : 10;
			unsigned long TH11 : 10;
			unsigned long TH12 : 10;
#endif
	} BIT;
	} GAMRAREA4;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long TH15 : 10;
			unsigned long TH14 : 10;
			unsigned long TH13 : 10;
			unsigned long  : 2;
#else
			unsigned long  : 2;
			unsigned long TH13 : 10;
			unsigned long TH14 : 10;
			unsigned long TH15 : 10;
#endif
	} BIT;
	} GAMRAREA5;
	char           wk13[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VEN : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long VEN : 1;
#endif
	} BIT;
	} OUTVEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PHASE : 2;
			unsigned long  : 2;
			unsigned long DIRSEL : 1;
			unsigned long  : 4;
			unsigned long FRQSEL : 1;
			unsigned long  : 2;
			unsigned long FORMAT : 2;
			unsigned long  : 10;
			unsigned long SWAPON : 1;
			unsigned long  : 3;
			unsigned long ENDIANON : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long ENDIANON : 1;
			unsigned long  : 3;
			unsigned long SWAPON : 1;
			unsigned long  : 10;
			unsigned long FORMAT : 2;
			unsigned long  : 2;
			unsigned long FRQSEL : 1;
			unsigned long  : 4;
			unsigned long DIRSEL : 1;
			unsigned long  : 2;
			unsigned long PHASE : 2;
#endif
	} BIT;
	} OUTSET;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BRTG : 10;
			unsigned long  : 22;
#else
			unsigned long  : 22;
			unsigned long BRTG : 10;
#endif
	} BIT;
	} BRIGHT1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BRTR : 10;
			unsigned long  : 6;
			unsigned long BRTB : 10;
			unsigned long  : 6;
#else
			unsigned long  : 6;
			unsigned long BRTB : 10;
			unsigned long  : 6;
			unsigned long BRTR : 10;
#endif
	} BIT;
	} BRIGHT2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long CONTR : 8;
			unsigned long CONTB : 8;
			unsigned long CONTG : 8;
			unsigned long  : 8;
#else
			unsigned long  : 8;
			unsigned long CONTG : 8;
			unsigned long CONTB : 8;
			unsigned long CONTR : 8;
#endif
	} BIT;
	} CONTRAST;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long PD : 2;
			unsigned long  : 2;
			unsigned long PC : 2;
			unsigned long  : 2;
			unsigned long PB : 2;
			unsigned long  : 2;
			unsigned long PA : 2;
			unsigned long  : 2;
			unsigned long FORM : 2;
			unsigned long  : 2;
			unsigned long SEL : 2;
			unsigned long  : 10;
#else
			unsigned long  : 10;
			unsigned long SEL : 2;
			unsigned long  : 2;
			unsigned long FORM : 2;
			unsigned long  : 2;
			unsigned long PA : 2;
			unsigned long  : 2;
			unsigned long PB : 2;
			unsigned long  : 2;
			unsigned long PC : 2;
			unsigned long  : 2;
			unsigned long PD : 2;
#endif
	} BIT;
	} PANELDTHA;
	char           wk14[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 3;
			unsigned long TCON3EDG : 1;
			unsigned long TCON2EDG : 1;
			unsigned long TCON1EDG : 1;
			unsigned long TCON0EDG : 1;
			unsigned long  : 1;
			unsigned long LCDEDG : 1;
			unsigned long  : 3;
			unsigned long FRONTGAM : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long FRONTGAM : 1;
			unsigned long  : 3;
			unsigned long LCDEDG : 1;
			unsigned long  : 1;
			unsigned long TCON0EDG : 1;
			unsigned long TCON1EDG : 1;
			unsigned long TCON2EDG : 1;
			unsigned long TCON3EDG : 1;
			unsigned long  : 3;
#endif
	} BIT;
	} CLKPHASE;
	char           wk15[28];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long OFFSET : 11;
			unsigned long  : 5;
			unsigned long HALF : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long HALF : 11;
			unsigned long  : 5;
			unsigned long OFFSET : 11;
#endif
	} BIT;
	} TCONTIM;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VW : 11;
			unsigned long  : 5;
			unsigned long VS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long VS : 11;
			unsigned long  : 5;
			unsigned long VW : 11;
#endif
	} BIT;
	} TCONSTVA1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SEL : 3;
			unsigned long  : 1;
			unsigned long INV : 1;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long INV : 1;
			unsigned long  : 1;
			unsigned long SEL : 3;
#endif
	} BIT;
	} TCONSTVA2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VW : 11;
			unsigned long  : 5;
			unsigned long VS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long VS : 11;
			unsigned long  : 5;
			unsigned long VW : 11;
#endif
	} BIT;
	} TCONSTVB1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SEL : 3;
			unsigned long  : 1;
			unsigned long INV : 1;
			unsigned long  : 27;
#else
			unsigned long  : 27;
			unsigned long INV : 1;
			unsigned long  : 1;
			unsigned long SEL : 3;
#endif
	} BIT;
	} TCONSTVB2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long HW : 11;
			unsigned long  : 5;
			unsigned long HS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long HS : 11;
			unsigned long  : 5;
			unsigned long HW : 11;
#endif
	} BIT;
	} TCONSTHA1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SEL : 3;
			unsigned long  : 1;
			unsigned long INV : 1;
			unsigned long  : 3;
			unsigned long HSSEL : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long HSSEL : 1;
			unsigned long  : 3;
			unsigned long INV : 1;
			unsigned long  : 1;
			unsigned long SEL : 3;
#endif
	} BIT;
	} TCONSTHA2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long HW : 11;
			unsigned long  : 5;
			unsigned long HS : 11;
			unsigned long  : 5;
#else
			unsigned long  : 5;
			unsigned long HS : 11;
			unsigned long  : 5;
			unsigned long HW : 11;
#endif
	} BIT;
	} TCONSTHB1;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long SEL : 3;
			unsigned long  : 1;
			unsigned long INV : 1;
			unsigned long  : 3;
			unsigned long HSSEL : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long HSSEL : 1;
			unsigned long  : 3;
			unsigned long INV : 1;
			unsigned long  : 1;
			unsigned long SEL : 3;
#endif
	} BIT;
	} TCONSTHB2;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long INV : 1;
			unsigned long  : 31;
#else
			unsigned long  : 31;
			unsigned long INV : 1;
#endif
	} BIT;
	} TCONDE;
	char           wk16[20];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VPOSDTC : 1;
			unsigned long GR1UFDTC : 1;
			unsigned long GR2UFDTC : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long GR2UFDTC : 1;
			unsigned long GR1UFDTC : 1;
			unsigned long VPOSDTC : 1;
#endif
	} BIT;
	} DTCTEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VPOSINTEN : 1;
			unsigned long GR1UFINTEN : 1;
			unsigned long GR2UFINTEN : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long GR2UFINTEN : 1;
			unsigned long GR1UFINTEN : 1;
			unsigned long VPOSINTEN : 1;
#endif
	} BIT;
	} INTEN;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VPOSCLR : 1;
			unsigned long GR1UFCLR : 1;
			unsigned long GR2UFCLR : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long GR2UFCLR : 1;
			unsigned long GR1UFCLR : 1;
			unsigned long VPOSCLR : 1;
#endif
	} BIT;
	} STCLR;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VPOS : 1;
			unsigned long GR1UF : 1;
			unsigned long GR2UF : 1;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long GR2UF : 1;
			unsigned long GR1UF : 1;
			unsigned long VPOS : 1;
#endif
	} BIT;
	} STMON;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long DCDR : 6;
			unsigned long CLKEN : 1;
			unsigned long  : 1;
			unsigned long CLKSEL : 1;
			unsigned long  : 3;
			unsigned long PIXSEL : 1;
			unsigned long  : 19;
#else
			unsigned long  : 19;
			unsigned long PIXSEL : 1;
			unsigned long  : 3;
			unsigned long CLKSEL : 1;
			unsigned long  : 1;
			unsigned long CLKEN : 1;
			unsigned long DCDR : 6;
#endif
	} BIT;
	} PANELCLK;
} st_glcdc_t;

